src/Catalogs/ТипыПлатформы/ТипыПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыПлатформы</name>
</mdclass:Catalog>

src/InformationRegisters/ОбъектыБлокировок/ОбъектыБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыБлокировок</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТипыПлатформы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СоздатьЭлементПоНаименованию(Наименование) Экспорт
	Результат = РезультатЗапросаПоНаименованию(Наименование);
	Если Результат.Пустой() Тогда
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОбъектыБлокировок");
			ЭлементБлокировки.УстановитьЗначение("Объект", "Справочник.ТипыПлатформы." + Наименование);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
		Исключение
			ВызватьИсключение "Центр мониторинга. Ожидаемая управляемая блокировка при создании элемента справочника 'ТипыПлатформы'";
		КонецПопытки;
		
		Результат = РезультатЗапросаПоНаименованию(Наименование);
		Если Результат.Пустой() Тогда
			НовыйЭлемент = Справочники.ТипыПлатформы.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Записать();
			
			РезультатВыполнения = НовыйЭлемент.Ссылка;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			РезультатВыполнения = Выборка.Ссылка;
		КонецЕсли;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		РезультатВыполнения = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
КонецФункции

Функция РезультатЗапросаПоНаименованию(Наименование)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ТипыПлатформы
	|ГДЕ
	|	Наименование = &Наименование
	|";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

#КонецЕсли
